In [10]:
import pandas as pd

In [11]:
data = {
    "name": ["Maria", "Spongebob", "Jason"],
    "height": [1.67, 1, 1.8],
    "weight": [54, 1, 80]
}

In [12]:
print(data)

{'name': ['Maria', 'Spongebob', 'Jason'], 'height': [1.67, 1, 1.8], 'weight': [54, 1, 80]}

In [13]:
data_df = pd.DataFrame(data)

In [14]:
data_df

        name  height  weight
0      Maria    1.67      54
1  Spongebob    1.00       1
2      Jason    1.80      80

In [15]:
# The length of the left side and the right side of this don't match yet,
# so we have to use a temporary variable for this:
# data_df["bmi"] = []

bmi = []

for i in range(len(data_df)):
    bmi_score = data_df["weight"][i] / (data_df["height"][i] ** 2)
    bmi.append(bmi_score)

data_df["bmi"] = bmi

data_df

        name  height  weight        bmi
0      Maria    1.67      54  19.362473
1  Spongebob    1.00       1   1.000000
2      Jason    1.80      80  24.691358

In [16]:
data_df.to_csv("bmi.csv", index=False)
data_df.to_html("bmi.html")
data_df.to_json("bmi.json")

In [17]:
import sqlite3 as sqlite

connection = sqlite.connect("bmi.sqlite") # you can specify ":memory:" as well

data_df.to_sql("users",
               index=False,
               con=connection,
               if_exists="replace")

3

In [18]:
sqlite_df = pd.read_sql("select * from users", connection)

sqlite_df

        name  height  weight        bmi
0      Maria    1.67      54  19.362473
1  Spongebob    1.00       1   1.000000
2      Jason    1.80      80  24.691358